// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.

function num(num) {
    console.log(num)
}

num(1)
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
function sum(num1,num2,num3){ //просто повторял функции
    const a = 10
    const b = 2
    const c = 5
    console.log(a + b + c)
}
sum()
// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
const hundred = 100
console.log(hundred * 2)
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
const dev = 67
console.log(dev % 7)
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму,
// разность, произведение и частное (результат деления).
const a1 = 10
const b1 = 2
console.log(a1 + b1)
console.log(a1 - b1)
console.log(a1 * b1)
console.log(a1 / b1)


// 6. Вам даны переменные c=15 и d=2.
// Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
    const c = 15
    const d = 2
result = c + d
console.log(result)
// 7. Вам даны переменные a=30, и b=15
// Сложите переменные a и b и результат присвойте переменной c.
//     Затем выведите в консоль остаток деления на 4 переменной c.

const a2 = 30
const b2 = 15
 c1 = a2 + b2
c1/=4
console.log(c)
// 8. Вам даны переменные a=17 и b=10.
// Отнимите от a переменную b и результат присвойте переменной c.
//     Затем создайте переменную d, присвойте ей значение.
//     Сложите переменные c и d, а результат запишите в переменную result.
//     Выведите в консоль значение переменной result.
const a3 = 17
const b3 = 10
c2 = a3 - b3
result1 = c2 + d
console.log(result1)
// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
const a4 = 10
const b4 = 99
result2=a4+b4
console.log(result2)
//Вам даны переменные name='лет', number=10.
// Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.
const name = "лет"
const number = 10
result3= number + name
console.log(result3)